#############################################################################################
# создаем словарь с парой значений: возраст и стоимость билета
price_list_dict = {'0-17': 0, '18-24': 990, '25+': 1390}
#############################################################################################
# создаем переменную в котрой будет храниться итоговая стоимость билетов
final_price = 0
#############################################################################################
# создаем переменную в которой будет храниться кол-во билетов
number_of_tickets = int(input('Введите количество билетов, которое хотите приобрести: '))
#############################################################################################
# с помошью цикла проверяем вводимый возраст и делаем проверку на ввод отрицательных чисел
# хотя можно было поидее написать number_of_tickets = abs(int(input('Введите количество билетов, которое хотите приобрести: ')))
for i in range(number_of_tickets):
    while True:
       try:
            age = int(input(f'Введите возраст посетителя № {i + 1}: '))
            if age < 0:
                raise ValueError('Work with Positive Numbers Only!!!')
       except ValueError:
            print('Ошибка! Допустим ввод только целых положительных чисел!')
            continue
       else:
           break
    if age < 18:
        final_price += price_list_dict['0-17']
    elif 18 <= age < 25:
        final_price += price_list_dict['18-24']
    else:
        final_price += price_list_dict['25+']
#############################################################################################
# проверяем скидку
if number_of_tickets > 3:
    final_price *= 0.9
#############################################################################################
# выводим итоговые значения стоимости билетов
print(f'Итоговая стоимость билетов: {format(final_price, ".2f")} рублей')
